app/controllers/todo_lists_controller.rb

  def index
    @todo_lists = TodoList.all
---
SELECT "todo_lists".* FROM "todo_lists"

  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save
---
INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", " test"], ["description", "tets"], ["created_at", "2019-03-27 12:46:51.534486"], ["updated_at", "2019-03-27 12:46:51.534486"]]

  def destroy
    @todo_list.destroy
---
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 2]]

    def set_todo_list
      @todo_list = TodoList.find(params[:id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]