app/controllers/todo_items_controller.rb

  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", ""], ["todo_list_id", 2], ["created_at", "2019-03-27 15:02:48.583452"], ["updated_at", "2019-03-27 15:02:48.583452"]]

  def destroy
    @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.destroy
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 1], ["id", 6], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 6]]

  def complete
    @todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2019-03-27 14:48:56.910967"], ["updated_at", "2019-03-27 14:48:56.912010"], ["id", 3]]

  def set_todo_list
    @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_todo_item
    @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 1], ["id", 3], ["LIMIT", 1]]